export const manufacturers = [
  "أكورا",
  "ألفا روميو",
  "أستون مارتن",
  "أودي",
  "بنتلي",
  "بي إم دبليو",
  "بويك",
  "كاديلاك",
  "شيفروليه",
  "كرايسلر",
  "سيتروين",
  "دودج",
  "فيراري",
  "فيات",
  "فورد",
  "جي إم سي",
  "هوندا",
  "هيونداي",
  "إنفينيتي",
  "جاغوار",
  "جيب",
  "كيا",
  "لامبورغيني",
  "لاند روفر",
  "لكزس",
  "لينكولن",
  "مازيراتي",
  "مازدا",
  "ماكلارين",
  "مرسيدس-بنز",
  "ميني",
  "ميتسوبيشي",
  "نيسان",
  "بورشه",
  "رام",
  "رولز رويس",
  "سوبارو",
  "تيسلا",
  "تويوتا",
  "فولكس فاجن",
  "فولفو"
];

export const yearsOfProduction = [
  { title: "السنة", value: "" },
  { title: "2015", value: "2015" },
  { title: "2016", value: "2016" },
  { title: "2017", value: "2017" },
  { title: "2018", value: "2018" },
  { title: "2019", value: "2019" },
  { title: "2020", value: "2020" },
  { title: "2021", value: "2021" },
  { title: "2022", value: "2022" },
  { title: "2023", value: "2023" },
];

export const fuels = [
  {
    title: "وقود",
    value: "",
  },
  {
    title: "ديزل",
    value: "ديزل",
  },
  {
    title: "بنزين",
    value: "بنزين",
  },
  {
    title: "كهرباء",
    value: "كهرباء",
  },
];


export const footerLinks = [
  {
    title: "عنا",
    links: [
      { title: "كيف يتم الحجز؟", url: "/" },
      { title: "العروض الخاصة", url: "/" },
      { title: "انضم إلينا كشريك", url: "/" },
      { title: "تعاون تجاري", url: "/" },
    ],
  },
  {
    title: "عن الشركة",
    links: [
      { title: "الفعاليات ", url: "/" },
      { title: "المدونة", url: "/" },
      { title: "بودكاست ", url: "/" },
      { title: "ادعُ أصدقاءك", url: "/" },
    ],
  },
  {
    title: "تابعنا ",
    links: [
      { title: "ديسكورد", url: "/" },
      { title: "انستغرام", url: "/" },
      { title: "تويتر", url: "/" },
      { title: "فايسبوك", url: "/" },
    ],
  },
];

export const arabickeys:{[key:string]:string} = {
  "class": "الفئة",
  "cylinders": "عدد الأسطوانات",
  "displacement": "السعة اللترية",
  "drive": "نظام نقل الحركة",
  "fuel_type": "نوع الوقود",
  "make": "الشركة",
  "model": "الموديل",
  "transmission": "ناقل الحركة",
  "year": "السنة",
  "price": "سعر الإيجار"
};
